uat_chat/Reports/уатАнализДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>уатАнализДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.уатУниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатДвижениеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатДвижениеДС</Name>
			<Comment>Движение ДС (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Reports/уатАнализДвиженияДенежныхСредств/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	уатДвижениеДСОбороты.Валюта КАК Валюта,
	|	уатДвижениеДСОбороты.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	уатДвижениеДСОбороты.ВидДенежныхСредств КАК ВидДенежныхСредств,
	|	уатДвижениеДСОбороты.ПриходРасход КАК ПриходРасход,
	|	уатДвижениеДСОбороты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	уатДвижениеДСОбороты.ДокументДвижения КАК ДокументДвижения,
	|	уатДвижениеДСОбороты.Контрагент КАК Контрагент,
	|	уатДвижениеДСОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатДвижениеДСОбороты.Сделка КАК Сделка,
	|	уатДвижениеДСОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходВалОборот,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходВалОборот,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокВалОборот,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходУпрОборот,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходУпрОборот,
	|	ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокУпрОборот,
	|	уатДвижениеДСОбороты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ГОД) КАК ПериодГод
	|{ВЫБРАТЬ
	|	Валюта.*,
	|	БанковскийСчетКасса.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	ДокументДвижения.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	Организация.*,
	|	СуммаПриходВалОборот,
	|	СуммаРасходВалОборот,
	|	ДенежныйПотокВалОборот,
	|	СуммаПриходУпрОборот,
	|	СуммаРасходУпрОборот,
	|	ДенежныйПотокУпрОборот,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}
	|ИЗ
	|	РегистрНакопления.уатДвижениеДС.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК уатДвижениеДСОбороты
	|{ГДЕ
	|	уатДвижениеДСОбороты.Валюта.*,
	|	уатДвижениеДСОбороты.БанковскийСчетКасса.*,
	|	уатДвижениеДСОбороты.ВидДенежныхСредств.*,
	|	уатДвижениеДСОбороты.ПриходРасход.*,
	|	уатДвижениеДСОбороты.СтатьяДвиженияДенежныхСредств.*,
	|	уатДвижениеДСОбороты.ДокументДвижения.*,
	|	уатДвижениеДСОбороты.Контрагент.*,
	|	уатДвижениеДСОбороты.ДоговорКонтрагента.*,
	|	уатДвижениеДСОбороты.Сделка.*,
	|	уатДвижениеДСОбороты.Организация.*,
	|	уатДвижениеДСОбороты.Период,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(уатДвижениеДСОбороты.Период, ГОД)) КАК ПериодГод,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПриходВалОборот,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРасходВалОборот,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДенежныйПотокВалОборот,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПриходУпрОборот,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРасходУпрОборот,
	|	(ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА уатДвижениеДСОбороты.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				ТОГДА уатДвижениеДСОбороты.СуммаУпрОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДенежныйПотокУпрОборот}
	|{УПОРЯДОЧИТЬ ПО
	|	Валюта.*,
	|	БанковскийСчетКасса.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	ДокументДвижения.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	Организация.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	СуммаПриходВалОборот,
	|	СуммаРасходВалОборот,
	|	ДенежныйПотокВалОборот,
	|	СуммаПриходУпрОборот,
	|	СуммаРасходУпрОборот,
	|	ДенежныйПотокУпрОборот}
	|ИТОГИ
	|	СУММА(СуммаПриходВалОборот),
	|	СУММА(СуммаРасходВалОборот),
	|	СУММА(ДенежныйПотокВалОборот),
	|	СУММА(СуммаПриходУпрОборот),
	|	СУММА(СуммаРасходУпрОборот),
	|	СУММА(ДенежныйПотокУпрОборот)
	|ПО
	|	Валюта,
	|	БанковскийСчетКасса,
	|	ДоговорКонтрагента,
	|	ПриходРасход,
	|	СтатьяДвиженияДенежныхСредств,
	|	Сделка,
	|	ДокументДвижения,
	|	Период,
	|	ВидДенежныхСредств,
	|	Организация,
	|	Контрагент,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|{ИТОГИ ПО
	|	Валюта.*,
	|	БанковскийСчетКасса.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	ДокументДвижения.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	Организация.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}";

	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	Пока УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
	КонецЦикла;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация"       , "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидДенежныхСредств", "Вид денежных средств (наличные, безналичные)");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение"     , "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент"        , "Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка"            , "Сделка");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументДвижения"  , "Документ движения");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяДвиженияДенежныхСредств", "Статья движения денежных средств");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("БанковскийСчетКасса", "Банковский счет/касса");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта             ", "Валюта движения");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>,
	//	<Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПриходВалОборот"  , "Поступления", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеОпераций", "В валюте операций");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходВалОборот"  , "Платежи", Ложь, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеОпераций");
	УниверсальныйОтчет.ДобавитьПоказатель("ДенежныйПотокВалОборот", "Чистый денежный поток", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеОпераций");
	Если Не уатОбщегоНазначения.ЭтоОбъединениеСБП() Тогда
		УниверсальныйОтчет.ДобавитьПоказатель("СуммаПриходУпрОборот"  , "Поступления", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета", "В валюте упр учета (" + глЗначениеПеременной("ВалютаУправленческогоУчета") + ")");
		УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходУпрОборот"  , "Платежи", Ложь, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета");
		УниверсальныйОтчет.ДобавитьПоказатель("ДенежныйПотокУпрОборот", "Чистый денежный поток", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета");
	КонецЕсли;
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяДвиженияДенежныхСредств");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("ВидДенежныхСредств");
	УниверсальныйОтчет.ДобавитьОтбор("БанковскийСчетКасса");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СуммаПоступленияВал", "ВалютаДенежныхСредств");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СуммаПлатежиВал", "ВалютаДенежныхСредств");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДенежныйПотокВал", "ВалютаДенежныхСредств");
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПустойЦФО", Справочники.Подразделения.ПустаяСсылка());
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", Перечисления.ВидыДвиженийПриходРасход.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Расход", Перечисления.ВидыДвиженийПриходРасход.Расход);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц,
//		5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
